# Parameters
nc: 12
activation: nn.Mish()
scales:
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]     
   
  - [-1, 1, Conv, [128, 3, 2]]
       #1
  - [-1, 3, C2f, [128, True]]  
     # 2
  - [-1, 1, Conv, [256, 3, 2]]  
    # 3
  - [-1, 6, C2f, [256, True]]   
    # 4
  - [-1, 1, Conv, [512, 3, 2]]  
    # 5
  - [-1, 6, C2f, [512, True]] 
      # 6
  - [-1, 1, Conv, [1024, 3, 2]]   
  # 7
  - [-1, 3, C2f, [1024, True]]
      # 8 
  - [-1, 1, SPPF, [1024, 5]]              

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 10
  - [[-1, 6], 1, Concat, [1]]                        # 11
  - [-1, 3, C2f, [512, True]]               # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 13
  - [[-1, 4], 1, Concat, [1]]                        # 14
  - [-1, 3, C2f, [256, True]]                # 15

  - [-1, 1, Conv, [256, 3, 2]]               # 16
  - [[-1, 12], 1, Concat, [1]]                       # 17
  - [-1, 3, C2f, [512, True]]                # 18
  - [-1, 1, Conv, [512, 3, 2]]               # 19
  - [[-1, 9], 1, Concat, [1]]                        # 20
  - [-1, 3, C2f, [1024, True]]
                 # 21

  - [[15, 18, 21], 1, Detect, [nc]]                  # 22
